[
    {
        "id": "scenario_001_tomato_late_blight",
        "name": "Late Blight on Tomato Plant",
        "image": "/games/plantdoctor/images/tomato_late_blight.jpg",
        "description": "The tomato plant leaves show dark, water-soaked spots with fuzzy, white fungal growth on the underside. Some stems and fruits also appear to be affected. The plant appears to be wilting rapidly in some areas, especially after cool, humid periods.",
        "correct_diagnosis": "Late Blight (Phytophthora infestans)",
        "resource_points": 50,
        "diagnostic_results": {
            "visual_inspection_general": {
                "type": "text",
                "text": "Widespread dark, water-soaked lesions on leaves and stems. Rapid wilting observed."
            },
            "visual_inspection_lowersurface": {
                "type": "text",
                "text": "Fuzzy, white fungal growth (sporangiophores) clearly visible, particularly along the margins of the lesions."
            },
            "visual_inspection_fruit_flower": {
                "type": "text",
                "text": "Firm, dark brown lesions on green fruits, which become leathery. Flowers show some necrosis."
            },
            "microscopic_view_fungal_spores": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/microscope_phytophthora_sporangia.jpg",
                "text": "Microscopic examination reveals characteristic lemon-shaped sporangia and branched sporangiophores of Phytophthora infestans."
            },
            "culture_pspa": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/culture_phytophthora.jpg",
                "text": "Culture on PSPA selective media shows rapid, cottony growth with irregular margins, typical of Phytophthora species colonies."
            },
            "elisa_test_antigen": {
                "type": "text",
                "text": "ELISA test results indicate a strong positive for Phytophthora infestans antigens."
            },
            "pcr_test_specific": {
                "type": "text",
                "text": "PCR amplification with specific primers for Phytophthora infestans shows a distinct band, confirming its presence."
            },
            "soil_moisture_test": {
                "type": "text",
                "text": "Soil moisture is consistently high, favoring oomycete development."
            },
            "ambient_temperature_measurement": {
                "type": "text",
                "text": "Ambient temperature measurements show cool (18-22°C), humid conditions, highly conducive to late blight."
            }
        }
    },
    {
        "id": "scenario_002_corn_nitrogen_deficiency",
        "name": "Nitrogen Deficiency in Corn",
        "image": "/games/plantdoctor/images/corn_nitrogen_deficiency.jpg",
        "description": "The corn leaves are uniformly yellowing, especially the older leaves, and growth appears stunted. The yellowing starts from the leaf tip and moves down the midrib, forming a 'V' shape.",
        "correct_diagnosis": "Nitrogen Deficiency",
        "resource_points": 40,
        "diagnostic_results": {
            "visual_inspection_general": {
                "type": "text",
                "text": "Older leaves showing general chlorosis (yellowing) starting from the tips and progressing inwards, creating a characteristic 'V' shape. Overall stunted growth."
            },
            "visual_inspection_uppersurface": {
                "type": "text",
                "text": "Uniform pale green to yellow discoloration on older leaves, particularly visible on the upper surface."
            },
            "soil_ph_test": {
                "type": "text",
                "text": "Soil pH test indicates a pH of 6.5, which is within normal range for corn, suggesting a nutrient issue rather than pH imbalance directly."
            },
            "soil_nutrient_test": {
                "type": "text",
                "text": "Soil test indicates very low levels of available nitrogen (N), while other major nutrients appear sufficient."
            },
            "tissue_analysis_macronutrients": {
                "type": "text",
                "text": "Leaf tissue analysis shows nitrogen levels significantly below critical thresholds for healthy corn growth, confirming a deficiency."
            },
            "root_examination": {
                "type": "text",
                "text": "Roots appear healthy and white, indicating no immediate issues with root rot or compaction limiting nutrient uptake."
            },
            "chlorophyll_content_measurement": {
                "type": "text",
                "text": "Chlorophyll meter reading (SPAD value) is significantly lower than healthy corn, consistent with reduced chlorophyll due to nitrogen deficiency."
            }
        }
    },
    {
        "id": "scenario_003_cucumber_powdery_mildew",
        "name": "Powdery Mildew on Cucumber",
        "image": "/games/plantdoctor/images/cucumber_powdery_mildew.jpg",
        "description": "White, powdery patches are visible on the upper and lower surfaces of cucumber leaves, as well as on stems. Affected leaves may turn yellow and shrivel.",
        "correct_diagnosis": "Powdery Mildew (Podosphaera xanthii)",
        "resource_points": 35,
        "diagnostic_results": {
            "visual_inspection_uppersurface": {
                "type": "text",
                "text": "Distinct white, flour-like spots cover the upper leaf surfaces. These spots can merge to cover entire leaves."
            },
            "visual_inspection_lowersurface": {
                "type": "text",
                "text": "Similar powdery spots are also observed on the lower leaf surfaces and stems. Yellowing of affected areas is noted."
            },
            "microscopic_view_fungal_spores": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/microscope_powdery_mildew.jpg",
                "text": "Microscopic examination reveals chains of conidia (spores) and superficial mycelial growth characteristic of powdery mildew fungi, without internal hyphae."
            },
            "culture_pda": {
                "type": "text",
                "text": "PDA culture attempts yield some mycelial growth, but often limited as powdery mildew are obligate parasites and difficult to culture in vitro."
            },
            "humidity_measurement": {
                "type": "text",
                "text": "Humidity measurements show fluctuating levels, but generally high daytime humidity combined with dry leaf surfaces, which favors fungal sporulation."
            },
            "foliar_spray_residue_analysis": {
                "type": "text",
                "text": "Analysis shows no recent fungicide application or an insufficient concentration to prevent fungal growth."
            }
        }
    },
    {
        "id": "scenario_004_tomato_bacterial_wilt",
        "name": "Bacterial Wilt on Tomato",
        "image": "/games/plantdoctor/images/tomato_bacterial_wilt.jpg",
        "description": "Tomato plant suddenly wilts during the day and recovers at night initially. Over time, wilting becomes permanent and the plant dies. When stems are cut, a milky ooze is visible.",
        "correct_diagnosis": "Bacterial Wilt (Ralstonia solanacearum)",
        "resource_points": 60,
        "diagnostic_results": {
            "visual_inspection_general": {
                "type": "text",
                "text": "Sudden, rapid wilting of entire branches or the whole plant, without significant yellowing or spotting. Wilting progresses quickly from initial recovery at night to permanent collapse."
            },
            "ooze_test": {
                "type": "text",
                "text": "When a freshly cut stem is placed in clean water, a milky, slimy stream (bacterial ooze) emanates from the cut end within minutes, confirming bacterial wilt."
            },
            "stem_split_test": {
                "type": "text",
                "text": "Splitting the stem reveals dark brown discoloration in the vascular tissues near the base, indicating bacterial colonization of xylem."
            },
            "microscopic_view_section": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/microscope_bacterial_wilt_section.jpg",
                "text": "Microscopic examination of a stem cross-section shows bacterial cells abundantly plugging xylem vessels."
            },
            "culture_na": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/culture_ralstonia.jpg",
                "text": "Culture on Nutrient Agar (NA) shows characteristic red-centered, irregular, fluidal colonies of Ralstonia solanacearum after 24-48 hours."
            },
            "pcr_test_specific": {
                "type": "text",
                "text": "PCR amplification with Ralstonia solanacearum-specific primers yields a strong positive result, confirming the presence of the pathogen's DNA."
            },
            "soil_ph_test": {
                "type": "text",
                "text": "Soil pH is around 5.5, which is slightly acidic and can favor Ralstonia solanacearum, though not directly diagnostic."
            }
        }
    },
    {
        "id": "scenario_005_rose_black_spot",
        "name": "Black Spot on Rose",
        "image": "/games/plantdoctor/images/rose_black_spot.jpg",
        "description": "Rose leaves exhibit circular black spots with fringed or feathery margins, often surrounded by a yellow halo. Heavily infected leaves are prematurely falling off, starting from the bottom of the plant.",
        "correct_diagnosis": "Black Spot (Diplocarpon rosae)",
        "resource_points": 45,
        "diagnostic_results": {
            "visual_inspection_general": {
                "type": "text",
                "text": "Numerous dark spots on leaves. Significant defoliation observed, especially lower leaves."
            },
            "visual_inspection_uppersurface": {
                "type": "text",
                "text": "Distinct circular black spots (2-12 mm diameter) with characteristic feathery edges and yellow halos. Spots often coalesce."
            },
            "visual_inspection_stem": {
                "type": "text",
                "text": "Small, purplish-red spots with irregular margins also present on young stems, less prominent than leaf spots."
            },
            "microscopic_view_fungal_spores": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/microscope_black_spot.jpg",
                "text": "Microscopic examination of black spots reveals acervuli (fruiting bodies) containing conidia (spores) of Diplocarpon rosae."
            },
            "culture_pda": {
                "type": "text",
                "text": "PDA culture from infected leaf tissue shows slow-growing, dark fungal colonies typical of Diplocarpon rosae."
            },
            "humidity_measurement": {
                "type": "text",
                "text": "Prolonged leaf wetness periods detected, which is critical for spore germination and infection."
            }
        }
    },
    {
        "id": "scenario_006_potato_common_scab",
        "name": "Common Scab on Potato",
        "image": "/games/plantdoctor/images/potato_common_scab.jpg",
        "description": "Potato tubers show rough, corky, irregularly shaped lesions that can be superficial, raised, or pitted. The lesions do not typically affect eating quality but reduce marketability. Foliage appears healthy.",
        "correct_diagnosis": "Common Scab (Streptomyces scabies)",
        "resource_points": 30,
        "diagnostic_results": {
            "visual_inspection_general": {
                "type": "text",
                "text": "Foliage looks healthy and robust. Problem is localized to tubers."
            },
            "visual_inspection_fruit_flower": {
                "type": "text",
                "text": "Potato tubers exhibit brown, rough, corky lesions. Lesions vary in depth from superficial russeting to deeply pitted. Shape is irregular."
            },
            "soil_ph_test": {
                "type": "text",
                "text": "Soil pH test indicates a pH of 7.5 (alkaline), which strongly favors the growth of Streptomyces scabies."
            },
            "soil_moisture_test": {
                "type": "text",
                "text": "Soil moisture levels were observed to be low during tuber initiation and development, exacerbating scab severity."
            },
            "culture_selective_media": {
                "type": "text",
                "text": "Culture on selective media for Streptomyces shows characteristic compact, leathery colonies with a distinct earthy odor."
            }
        }
    },
    {
        "id": "scenario_007_cabbage_clubroot",
        "name": "Clubroot of Cabbage",
        "image": "/games/plantdoctor/images/cabbage_clubroot.jpg",
        "description": "Cabbage plants are severely stunted and wilt during warm parts of the day, even with adequate soil moisture. Leaves turn yellowish or purplish. When plants are pulled, roots are swollen and distorted, forming 'clubs'.",
        "correct_diagnosis": "Clubroot (Plasmodiophora brassicae)",
        "resource_points": 55,
        "diagnostic_results": {
            "visual_inspection_general": {
                "type": "text",
                "text": "Plants are severely stunted and show chronic wilting, especially in warmer conditions."
            },
            "root_examination": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/clubroot_roots.jpg",
                "text": "Roots are grotesquely swollen, malformed, and distorted, forming characteristic 'clubs' or galls. Fine roots are often absent."
            },
            "microscopic_view_section": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/microscope_clubroot_section.jpg",
                "text": "Microscopic examination of a root section reveals large, multi-nucleate plasmodia and resting spores of Plasmodiophora brassicae within root cells."
            },
            "soil_ph_test": {
                "type": "text",
                "text": "Soil pH test indicates a pH of 5.0 (acidic), which is highly favorable for clubroot development."
            },
            "soil_moisture_test": {
                "type": "text",
                "text": "Soil moisture levels are consistently high, further promoting spore germination and infection."
            },
            "pcr_test_general": {
                "type": "text",
                "text": "PCR test on symptomatic root tissue yields a strong positive result for Plasmodiophora brassicae DNA."
            }
        }
    },
    {
        "id": "scenario_008_aphid_infestation_pepper",
        "name": "Aphid Infestation on Pepper",
        "image": "/games/plantdoctor/images/pepper_aphids.jpg",
        "description": "Pepper plants show curled, distorted, and yellowed leaves, especially on new growth. Sticky, shiny residue (honeydew) is visible on leaves and stems, and small, pear-shaped insects are present on the undersides of leaves and growing tips.",
        "correct_diagnosis": "Aphid Infestation",
        "resource_points": 30,
        "diagnostic_results": {
            "visual_inspection_general": {
                "type": "text",
                "text": "Overall stunted growth and sticky residue on leaves. Ants are observed on the plant."
            },
            "visual_inspection_lowersurface": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/aphids_underside.jpg",
                "text": "Numerous small, pear-shaped insects, green and black in color, are clustered on the undersides of leaves and on tender new shoots. Some winged forms are present."
            },
            "visual_inspection_stem": {
                "type": "text",
                "text": "Sticky, clear honeydew evident on stems, and sometimes sooty mold growing on the honeydew."
            },
            "leaf_press_test": {
                "type": "text",
                "text": "Pressing a leaf onto white paper reveals tiny green smears and some insect bodies."
            },
            "microscopic_view_mites_insects": {
                "type": "text",
                "text": "Microscopic view confirms the presence of aphids (Aphididae family) and their nymphs, without any evidence of mites."
            }
        }
    },
    {
        "id": "scenario_009_grape_downy_mildew",
        "name": "Downy Mildew on Grapevine",
        "image": "/games/plantdoctor/images/grape_downy_mildew.jpg",
        "description": "Grape leaves show irregular, yellowish-green spots on the upper surface, often appearing oily. On the corresponding lower surface, a white, cottony fungal growth is visible, particularly after humid nights. Infected leaves turn brown and fall off prematurely.",
        "correct_diagnosis": "Downy Mildew (Plasmopara viticola)",
        "resource_points": 48,
        "diagnostic_results": {
            "visual_inspection_uppersurface": {
                "type": "text",
                "text": "Irregular, yellowish-green 'oil spots' visible on the upper leaf surface."
            },
            "visual_inspection_lowersurface": {
                "type": "text",
                "text": "White, downy, cottony fungal growth (sporangiophores) clearly visible on the lower surface corresponding to the 'oil spots'."
            },
            "visual_inspection_fruit_flower": {
                "type": "text",
                "text": "Young berries turn dull grey-green, shrivel, and may be covered in white downy growth. Older berries become brown and leathery."
            },
            "microscopic_view_fungal_spores": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/microscope_plasmopara.jpg",
                "text": "Microscopic examination reveals characteristic tree-like or dichotomously branched sporangiophores bearing lemon-shaped sporangia, typical of Plasmopara viticola."
            },
            "culture_pspa": {
                "type": "text",
                "text": "Culture on PSPA selective media may show some oomycete growth, but often limited due to its obligate parasitic nature."
            },
            "ambient_temperature_measurement": {
                "type": "text",
                "text": "Temperature analysis shows periods above 10°C with significant leaf wetness duration (rain/dew), ideal for downy mildew infection."
            }
        }
    },
    {
        "id": "scenario_010_wheat_rust",
        "name": "Wheat Rust",
        "image": "/games/plantdoctor/images/wheat_rust.jpg",
        "description": "Wheat leaves and stems show small, raised, reddish-brown pustules that rupture the epidermis. When rubbed, an orange-brown powder comes off. Severe infections lead to yellowing, drying, and significant yield loss.",
        "correct_diagnosis": "Wheat Rust (Puccinia spp.)",
        "resource_points": 42,
        "diagnostic_results": {
            "visual_inspection_general": {
                "type": "text",
                "text": "Overall yellowing and drying of foliage observed. Rust-colored powder easily rubs off leaves."
            },
            "visual_inspection_uppersurface": {
                "type": "text",
                "text": "Small, oval to elongated, reddish-brown pustules erupting through the leaf surface, typically arranged in lines (for stripe rust) or scattered (for leaf/stem rust)."
            },
            "visual_inspection_stem": {
                "type": "text",
                "text": "Similar rust pustules also found on stems and leaf sheaths."
            },
            "microscopic_view_fungal_spores": {
                "type": "image_and_text",
                "image": "/games/plantdoctor/images/microscope_rust_urediniospores.jpg",
                "text": "Microscopic examination reveals characteristic orange-brown, echinulate (spiny) urediniospores, confirming a rust fungus."
            },
            "culture_pda": {
                "type": "text",
                "text": "PDA culture attempts usually yield no growth as rust fungi are obligate parasites."
            },
            "pcr_test_general": {
                "type": "text",
                "text": "PCR test on infected tissue confirms the presence of Puccinia DNA."
            }
        }
    }
]
